docs: switch big picture diagram back to ASCII
